#+TAGS:  PHYSICAL(0) [ WORK(1) : IMDA OGP ] SERENDIPITY(2) [ SIDEPROJECTS(3) : BLOG BOARDGAMEENGINE THESIS CS ] HOBBIES(4) RELATIONSHIPS(5)
------
To repeat
To clone type ~C-c C-x c~
~C-c C-t~ changes the state of a TODO
~C-c C-x C-i~ clocks in,
~C-c C-x C-o~ clocks out.
~C-c [~ adds to agenda.
~C-c C-x C-a~ moves it to the archive
------
* TODO CS Mondays
* TODO Thesis Tuesdays
** TODO Pair program with Gabe
SCHEDULED: <2020-12-22 Tue 22:00 +1w>
:PROPERTIES:
:LAST_REPEAT: [2020-12-17 Thu 23:12]
:END:
- State "DONE"       from "TODO"       [2020-12-17 Thu 23:12]
- State "DONE"       from "TODO"       [2020-12-07 Mon 19:27]
- State "DONE"       from "TODO"       [2020-12-01 Tue 22:51]
- State "DONE"       from "TODO"       [2020-11-24 Tue 11:40]
- State "DONE"       from "TODO"       [2020-11-18 Wed 00:36]
- State "KILL"       from "TODO"       [2020-11-12 Thu 11:01]
- State "DONE"       from "TODO"       [2020-11-03 Tue 23:54]
:LOGBOOK:
CLOCK: [2020-11-03 Tue 22:34]--[2020-11-03 Tue 23:53] =>  1:19
:END:
* TODO Working Paper Wednesdays
** TODO Checkin with Joel
SCHEDULED: <2020-12-23 Wed 22:00 ++1w>
:PROPERTIES:
:LAST_REPEAT: [2020-12-18 Fri 10:53]
:END:
- State "KILL"       from "TODO"       [2020-12-18 Fri 10:53]
- State "KILL"       from "TODO"       [2020-12-14 Mon 00:42]
- State "DONE"       from "TODO"       [2020-12-04 Fri 09:09]
- State "KILL"       from "TODO"       [2020-11-26 Thu 10:02]
- State "DONE"       from "TODO"       [2020-11-19 Thu 13:29]
- State "DONE"       from "TODO"       [2020-11-12 Thu 11:01]
* TODO Deutsche Donnerstag
** TODO Hangout with Celine
SCHEDULED: <2020-12-24 Thu 23:00 +1w>
:PROPERTIES:
:LAST_REPEAT: [2020-12-18 Fri 10:53]
:END:
- State "DONE"       from "TODO"       [2020-12-18 Fri 10:53]
- State "DONE"       from "TODO"       [2020-12-04 Fri 01:11]
- State "DONE"       from "TODO"       [2020-12-04 Fri 01:11]
- State "DONE"       from "TODO"       [2020-11-27 Fri 10:51]
- State "DONE"       from "TODO"       [2020-11-20 Fri 10:05]

* TODO Freedom Fridays
* TODO Writing/Board Game Saturdays
** HOLD Finish and ship MVP of Board Game Engine: server and lobby
*** TODO Pair program with Joshua
SCHEDULED: <2020-12-19 Sat 22:00 +1w>
:PROPERTIES:
:LAST_REPEAT: [2020-12-18 Fri 10:53]
:END:
- State "KILL"       from "TODO"       [2020-12-18 Fri 10:53]
- State "KILL"       from "TODO"       [2020-12-06 Sun 20:46]
- State "DONE"       from "TODO"       [2020-12-01 Tue 00:43]
- State "KILL"       from "TODO"       [2020-11-26 Thu 15:14]
:LOGBOOK:
CLOCK: [2020-11-03 Tue 21:49]--[2020-11-03 Tue 22:32] =>  0:43
:END:
* TODO Review/Serendipitous Sundays


* TODO Write a quick post about Lab 1 and Assignment 1 for CS107E
SCHEDULED: <2020-12-19 Sat>
* TODO Write a quick post about Lab 2 for CS107E
* TODO Get thesis code running on my computer
* TODO Write weekly review
* TODO Set up CD pipeline for my blog
* TODO Think a bit about doing a DIY Stanford CS degree in a year
SCHEDULED: <2020-12-19 Sat>
* TODO Write group testing post
[[file:group_testing.md][Group Testing]]
** TODO Draw more diagrams as necessary and rework Bernard's text
SCHEDULED: <2020-12-19 Sat>
* TODO Attend standup
SCHEDULED: <2020-12-22 Tue 10:00 ++1d>
:PROPERTIES:
:LAST_REPEAT: [2020-12-21 Mon 09:54]
:ORDERED:  t
:END:
- State "DONE"       from "TODO"       [2020-12-21 Mon 09:54]
- State "KILL"       from "TODO"       [2020-12-19 Sat 14:36]
- State "DONE"       from "TODO"       [2020-12-18 Fri 17:58]
- State "DONE"       from "TODO"       [2020-12-17 Thu 18:09]
- State "KILL"       from "TODO"       [2020-12-16 Wed 11:32]
- State "DONE"       from "TODO"       [2020-12-15 Tue 08:21]
- State "DONE"       from "TODO"       [2020-12-14 Mon 11:10]
- State "KILL"       from "TODO"       [2020-12-14 Mon 00:42]
- State "DONE"       from "TODO"       [2020-12-08 Tue 06:19]
- State "DONE"       from "TODO"       [2020-12-07 Mon 19:25]
- State "KILL"       from "TODO"       [2020-12-06 Sun 20:36]
- State "KILL"       from "TODO"       [2020-12-03 Thu 12:31]
- State "DONE"       from "TODO"       [2020-12-02 Wed 16:41]
- State "DONE"       from "TODO"       [2020-12-01 Tue 10:46]
- State "DONE"       from "TODO"       [2020-12-01 Tue 00:42]
- State "KILL"       from "TODO"       [2020-11-27 Fri 12:43]
- State "DONE"       from "TODO"       [2020-11-26 Thu 10:23]
- State "DONE"       from "TODO"       [2020-11-25 Wed 09:35]
- State "DONE"       from "TODO"       [2020-11-24 Tue 11:31]
- State "DONE"       from "TODO"       [2020-11-23 Mon 16:05]
- State "DONE"       from "TODO"       [2020-11-20 Fri 10:05]
- State "KILL"       from "TODO"       [2020-11-19 Thu 13:29]
- State "DONE"       from "TODO"       [2020-11-18 Wed 14:06]
- State "KILL"       from "TODO"       [2020-11-17 Tue 19:44]
- State "DONE"       from "TODO"       [2020-11-16 Mon 11:31]
- State "DONE"       from "TODO"       [2020-11-12 Thu 10:53]
- State "DONE"       from "TODO"       [2020-11-10 Tue 10:30]
- State "DONE"       from "TODO"       [2020-11-06 Fri 09:29]
:LOGBOOK:
CLOCK: [2020-11-06 Fri 09:03]--[2020-11-06 Fri 09:29] =>  0:26
CLOCK: [2020-11-04 Wed 09:45]--[2020-11-04 Wed 10:37] =>  0:52
:END:
- State "DONE"       from "TODO"       [2020-11-04 Wed 10:36]
- State "DONE"       from "TODO"       [2020-11-03 Tue 09:53]
* TODO Write up reasons why I prefer OGP
SCHEDULED: <2020-12-08 Tue>
* TODO Write email to EMA
SCHEDULED: <2020-12-07 Mon>
* TODO Write for the blog :BLOG:
** TODO Upload my exam paper attempts
SCHEDULED: <2020-12-19 Sat>
** TODO Upload my notes
** TODO Write series about "How to write a First-Class Oxford PPE essay":
  - how to read,
  - how to synthesise what you've read into a big debate/ few key viewpoints
  - "Think very hard",
  - how to structure the essay
** TODO Write post about my three years in Oxford
  - Year 1
  - Year 2
  - Year 3
*** TODO collate pictures
** TODO Write a post about Board Game Engine
** TODO New exploration: why is metro construction in Singapore so expensive?
Why have costs ballooned over the past fifteen years?
Check [[https://pedestrianobservations.com/?s=singapore][Pedestrian Observations]] and wait for Alon's reply

**EDIT**
[[https://pedestrianobservations.com/][New post from Alon:]]

> It increasingly looks like the cause of high construction costs in the
English-speaking world is the trend of the privatization of the state since the
1980s. Instead of public planning departments, there is growing use of
consultants. This trend is intensifying, for example with increasing use of
design-build contracts, introduced into Canada just before costs exploded.

*** HOLD Follow up with Alon
** TODO New exploration: could Singapore afford a UBI? What would it take?
** TODO New post: the importance of minimising friction
:LOGBOOK:
CLOCK: [2020-11-06 Fri 22:27]--[2020-11-07 Sat 17:52] => 19:25
:END:
[[file:20201106170251-making_your_habits_zero_friction_is_a_massive_productivity_hack.org][Making your habits zero-friction is a massive productivity hack]]   
** TODO New post: The six pillars of software engineering tradeoffs (or something about complexity budgets)
[[file:20201106172548-the_complexity_budget_is_actually_a_budget.org][The "complexity budget" is actually a budget]] 
** TODO New post: Convergence is (finally) coming
[[file:convergence_is_finally_coming.md][Convergence is (finally) coming]]
** TODO New post: Teaching game theory (PBEs) using one of Faker's plays
[[file:20201119143515-learn_game_theory_from_league_of_legends_faker_s_fakeout.org][Learn game theory from League of Legends: Faker's Fakeout]]
** TODO New post: Three levels of competence
 [[file:three_levels_of_competency.md][There are three levels of competency in any field]]
** TODO New post: A universal digital identity for every Singaporean
- it's coming, with SingPass allowing you to check your education and all that
- Vista? Ministry of Stats? Data.gov.sg?
- API-zing every single store of data in every ministry
** HOLD New post: Singapore's historical land usage for golf courses
** TODO New post: Group testing, part II: testing in parallel
** TODO New post: Group testing, part III: having an upper bound on the number of steps.
** DONE Write post about interviewing with OGP and preparation process, even if I get rejected
SCHEDULED: <2020-11-07 Sat>
:LOGBOOK:
CLOCK: [2020-11-05 Thu 22:25]--[2020-11-06 Fri 00:00] => 01:35
:END:
Clarified with Russell what I am or am not allowed to say:

> my general principle which I'd say to OGP officers (and I counting you in that
> fold by extension) is go ahead and share freely, but dont go and share
> something that would give any reader an unfair advantage into the actual
> hiring process e.g. the stuff we tell u about what we're looking for - yeah you
> can go ahead and share that too. but the actual questions we use and ask,
> please don't
[[file:my_ogp_interview_experience.md][My OGP interview experience]]

* HOLD Build stuff :SIDEPROJECTS:
** HOLD Build adjustable monitor stand
** KILL Build DIY RGBA night lamp
** HOLD Build Julia Path Tracer
** HOLD Build [[https://www.benkuhn.net/krss/][KindleRSS]] but for the Remarkable.
Idea from Ben Kuhn.
Check the following [GitHub repo](https://github.com/reHackable/awesome-reMarkable).
Check also [this link](https://umanovskis.se/blog/post/remarkable-email/)
** HOLD Repair gramophone
* HOLD Buy things [5/7]
- [X] Buy home gym equipment (~\$800--\$2000)
- [X] Buy a new toothbrush
- [X] Buy a webcam
- [X] Earplugs (for both me and Celine)
- [X] Buy a night light
- [ ] Buy split keyboard (~ \$500)
- [X] Mirror wall
* HOLD Improve the UX of my website :BLOG:
** TODO Add "Related Posts" widget on my posts
** TODO Improve my blog: Filter pages, tag pages, tag search, tag index pages...
** DONE Add blogroll
* HOLD Find a format for my resume that fulfills all my goals :WORK:
(not too verbose/hard to edit, exports nicely to PDF, also exports to HTML,
layout customisable by me)
* WAIT Attend the interview with GovTech CEO
SCHEDULED: <2021-01-15 Fri 10:00-11:00>
* HOLD Read what Nobiot wrote and look how I can use markdown with org/convert org to MD
* HOLD Think of a way to display/digest time spent on each todo in a week
* HOLD Canvas some support for my forest protection mechanism idea :SIDEPROJECTS:
** TODO Post it on LessWrong?
* WAIT Wait for IMDA to calculate my LD
* WAIT Add feature request to support Jekyll-style tags in org-roam
* HOLD Publish cryptogram book on Amazon
** HOLD Add gutter margins
[[https://github.com/bpampuch/pdfmake/issues/2106#event-3945256138][GitHub link]]
*** DONE Read the code for adding gutter margins
DEADLINE: <2020-11-15 Sun>
*** DONE Wait for a reply on my issue on GitHub
** DONE Think about meeting with NYC and Nicole
Leader PFA fund?? All of our Youth Corps leaders
FOr a period of three years you have a "Pay it forward" award
Seed fund is for any leader to start and sustain a project

- Talk to social workers to do need analysis
- Adults with special needs? Would they greatly benefit?

Adult with special needs: homebound. They depend on caregivers.
They stay inside, they can only do things inside
and then they stare/watch TV the whole day.
** DONE Meet with NYC
SCHEDULED: <2020-11-13 Fri 15:00-16:00>
Zoom Date: 13 Nov 2020
Zoom ID: 876 2180 2169
Zoom PW: 131120
Time: 3.00pm to 4.00pm folks
